In [1]:
import pandas as pd
pd.set_option('display.max_columns', None)

In [2]:
import warnings
warnings.simplefilter('ignore')

# para pintar
import pylab as plt
import seaborn as sns
import numpy as np

# para que salga el grafico
%matplotlib inline


## Carga de los datos

In [3]:
actor_csv=pd.read_csv("../data/actor.csv")
category_csv=pd.read_csv("../data/category.csv")
film_csv=pd.read_csv("../data/film.csv")
inventory_csv=pd.read_csv("../data/inventory.csv")
language_csv=pd.read_csv("../data/language.csv")
rental_csv=pd.read_csv("../data/rental.csv")
old_hdd_csv=pd.read_csv("../data/old_HDD.csv")

## Exploraci√≥n de los datos

Exploramos actor_csv

In [4]:
actor_csv.head(2)

   actor_id first_name last_name          last_update
0         1   PENELOPE   GUINESS  2006-02-15 04:34:33
1         2       NICK  WAHLBERG  2006-02-15 04:34:33

In [5]:
actor_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    int64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    object
dtypes: int64(1), object(3)
memory usage: 6.4+ KB

Exploramos category_csv:

In [6]:
category_csv.head(1)

   category_id    name          last_update
0            1  Action  2006-02-15 04:46:27

In [7]:
category_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   category_id  16 non-null     int64
 1   name         16 non-null     object
 2   last_update  16 non-null     object
dtypes: int64(1), object(2)
memory usage: 512.0+ bytes

Exploramos film_csv:

In [8]:
film_csv.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,NaN,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,NaN,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [9]:
film_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   film_id               1000 non-null   int64
 1   title                 1000 non-null   object
 2   description           1000 non-null   object
 3   release_year          1000 non-null   int64
 4   language_id           1000 non-null   int64
 5   original_language_id  0 non-null      float64
 6   rental_duration       1000 non-null   int64
 7   rental_rate           1000 non-null   float64
 8   length                1000 non-null   int64
 9   replacement_cost      1000 non-null   float64
 10  rating                1000 non-null   object
 11  special_features      1000 non-null   object
 12  last_update           1000 non-null   object
dtypes: float64(3), int64(5), object(5)
memory usage: 101.7+ KB

Exploramos inventory_csv:

In [10]:
inventory_csv.head(2)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17

In [11]:
inventory_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

Exploramos language_csv:

In [12]:
language_csv.head(2)

   language_id     name          last_update
0            1  English  2006-02-15 05:02:19
1            2  Italian  2006-02-15 05:02:19

In [13]:
language_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   language_id  6 non-null      int64
 1   name         6 non-null      object
 2   last_update  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

Exploramos rental_csv:

In [14]:
rental_csv.head(2)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53

In [15]:
rental_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   rental_id     1000 non-null   int64
 1   rental_date   1000 non-null   object
 2   inventory_id  1000 non-null   int64
 3   customer_id   1000 non-null   int64
 4   return_date   1000 non-null   object
 5   staff_id      1000 non-null   int64
 6   last_update   1000 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.8+ KB

Exploramos old_hdd_csv:

In [16]:
old_hdd_csv.head(1)

  first_name last_name             title  release_year  category_id
0   PENELOPE   GUINESS  ACADEMY DINOSAUR          2006            6

In [17]:
old_hdd_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   first_name    1000 non-null   object
 1   last_name     1000 non-null   object
 2   title         1000 non-null   object
 3   release_year  1000 non-null   int64
 4   category_id   1000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 39.2+ KB

Despu√©s de explorar las tablas vemos que es un negocio de alquiler de pel√≠culas. 

Por un lado tenemos la tabla rental_csv que es como si fueran los invoices, es decir para cada pel√≠cula que se alquila tenemos la informaci√≥n sobre esa operaci√≥n. Esta tabla se relaciona por un lado a inventory_csv por el inventory_id ya que tenemos que saber que cinta particular de nuestro stock se ha alquilado. De la misma manera, el inventory_csv esta unido a film_csv por el film_id ya que tenemos que saber a que t√≠tulo de pel√≠cula corresponde la cinta que estamos alquilando. 


Tambi√©n tenemos relaci√≥n entrar film_csv y language_csv >> est√°n relacionadas por el language_id ya que tenemos que saber en que lenguaje est√° la pel√≠cula.

Finalmente tenemos otra tabla llamada old_hdd_csv que une por un lado con la tabla category_csv a trav√©s del category_id, por otro lado con la tabla film_csv a trav√©s de title y con actor_csv a trav√©s de name y first_name.

#### Entre film_csv y actor_csv habr√° una relaci√≥n many to many y entre category_id y film_id habr√° una relaci√≥n one to one

# Limpieza de Datos

Hemos visto que solo hay nulos en el film_csv en la columna original_language_id que es toda nula, por lo que vamos a eliminar la columna directamente

In [18]:
film_csv.drop('original_language_id', axis=1, inplace=True)

In [19]:
film_csv.head(1)

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2006-02-15 05:03:42

Vamos a eliminar los duplicados

In [20]:
actor_csv.duplicated().any()

False

In [21]:
category_csv.duplicated().any()

False

In [22]:
film_csv.duplicated().any()

False

In [23]:
inventory_csv.duplicated().any()

False

In [24]:
language_csv.duplicated().any()

False

In [25]:
rental_csv.duplicated().any()

False

In [26]:
old_hdd_csv.duplicated().any()

False

No hay duplicados en ning√∫n csv por lo que ya est√°n limpios los datos

Las columnas last_update entiendo que hacen referencia a la √∫ltima vez que se actualiz√≥ la base de datos por lo que no me van a ofrecer informaci√≥n relevante, as√≠ que las elimino.

In [27]:
actor_csv.drop('last_update', axis=1, inplace=True)
category_csv.drop('last_update', axis=1, inplace=True)
film_csv.drop('last_update', axis=1, inplace=True)
inventory_csv.drop('last_update', axis=1, inplace=True)
language_csv.drop('last_update', axis=1, inplace=True)
rental_csv.drop('last_update', axis=1, inplace=True)

## Unimos first_name y last_name en actor_csv y old_hdd_csv

In [28]:
actor_csv["full name"]=actor_csv.first_name+" "+actor_csv.last_name

In [29]:
film_csv.tail()

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,6,0.99,183,9.99,G,"Trailers,Behind the Scenes"
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes"
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,6,0.99,105,10.99,NC-17,Deleted Scenes
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,5,2.99,101,28.99,R,"Trailers,Deleted Scenes"
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes"

In [30]:
actor_csv.head(1)

   actor_id first_name last_name         full name
0         1   PENELOPE   GUINESS  PENELOPE GUINESS

In [31]:
old_hdd_csv["full name"]=old_hdd_csv.first_name+" "+old_hdd_csv.last_name

Vamos a elimnar columnas first name y last_name

In [32]:
old_hdd_csv.drop('first_name', axis=1, inplace=True)

In [33]:
old_hdd_csv.drop('last_name', axis=1, inplace=True)

In [34]:
old_hdd_csv.head(1)

              title  release_year  category_id         full name
0  ACADEMY DINOSAUR          2006            6  PENELOPE GUINESS

## Uni√≥n film_csv y old_hdd_csv

Estas dos columnas est√°n relacionadas for "title". El problema es que si comparamos, en old_hdd_csv no est√°n incluidos todos los t√≠tulos de film_csv

In [35]:
film_csv.title.isin(old_hdd_csv.title).unique()

array([ True, False])

In [36]:
old_hdd_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         1000 non-null   object
 1   release_year  1000 non-null   int64
 2   category_id   1000 non-null   int64
 3   full name     1000 non-null   object
dtypes: int64(2), object(2)
memory usage: 31.4+ KB

In [37]:
frame_to_join=pd.DataFrame()

In [38]:
frame_to_join['title']=film_csv.title[~film_csv['title'].isin(old_hdd_csv.title)]

In [39]:
frame_to_join['release_year']=film_csv.release_year[~film_csv['release_year'].isin(old_hdd_csv.title)]

El full_name del actor no lo sabemos para las pel√≠culas que no est√°n incluidas en old_hdd_csv por lo uqe rellenamos con unknown

In [40]:
frame_to_join['full name']="Unknown"

nos falta a√±adir el category_id de las peliculas que faltan, no tenemos la informaci√≥n por lo que vamos a ponerle categoria 0

In [41]:
frame_to_join['category_id']=0

In [42]:
frame_to_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 386 entries, 3 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         386 non-null    object
 1   release_year  386 non-null    int64
 2   full name     386 non-null    object
 3   category_id   386 non-null    int64
dtypes: int64(2), object(2)
memory usage: 15.1+ KB

Ahora vamos a unir las Dataframes old_hdd_csv y frame_to_join

In [43]:
old_hdd_csv=pd.concat([old_hdd_csv,frame_to_join])

In [56]:
old_hdd_csv.head(2)

                  title  release_year  category_id         full name
0      ACADEMY DINOSAUR          2006            6  PENELOPE GUINESS
1  ANACONDA CONFESSIONS          2006            2  PENELOPE GUINESS

## A√±adiendo categoria

Vamos a a√±adir una nueva categoria a category_id que sea categoria 0 == "Unknown" para que no nos den problema aquellas peliculas para las que no tenemos categorias

In [46]:
data=[{"category_id":0,"name":"unknown"}]

In [47]:
category_csv=category_csv.append(data,ignore_index=True,sort=False)

## Editamos el inventory_id

Como el inventory_id en la tabla inventory va solo del 1-1000 y  en la tabla rental tenemos una gran parte de inventories superiores a 1000, no podriamos trabajar con los inventory ids con la mayoria de pel√≠culas. Entonces para poder trabajar bien, vamos a sustituir los valores de la columna inventory_id de la dataframe rental_csv por valores random entre el 1-1000.

In [48]:
rental_csv.inventory_id=np.random.randint(1,1000, size=len(rental_csv))

# Subimos los csv

In [49]:
category_csv.to_csv("../data/clean2_csv/category_new.csv",index=False)

In [50]:
inventory_csv.to_csv("../data/clean2_csv/inventory_new.csv",index=False)

In [51]:
language_csv.to_csv("../data/clean2_csv/language_new.csv",index=False)

In [52]:
rental_csv.to_csv("../data/clean2_csv/rental_new.csv",index=False)

In [53]:
actor_csv.to_csv("../data/clean2_csv/actor.csv",index=False)

In [54]:
film_csv.to_csv("../data/clean2_csv/film.csv",index=False)

In [55]:
old_hdd_csv.to_csv("../data/clean2_csv/old_hdd.csv",index=False)

Exportamos la nueva tabla a csv